---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarInSystem.GetPresentationMode(Autodesk.Revit.DB.View)
source: html/6fd30c59-4218-7dcf-ddf8-494d04d98744.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.GetPresentationMode Method

Gets the presentaion mode for this rebar set when displayed in the given view.

## Syntax (C#)
```csharp
public RebarPresentationMode GetPresentationMode(
	View dBView
)
```

## Parameters
- **dBView** (`Autodesk.Revit.DB.View`) - The view.

## Returns
The presentation mode.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null